app/controllers/application_controller.rb

  def current_user
    if session[:user_id]
      Teacher.find_by(id: session[:user_id])
    elsif session[:student_id]
      Student.find_by(id: session[:student_id])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]