app/controllers/progressions_controller.rb

INSERT INTO "student_progressions" ("student_id", "progression_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["student_id", 3], ["progression_id", 6], ["created_at", "2020-01-16 16:37:42.535486"], ["updated_at", "2020-01-16 16:37:42.535486"]]
SELECT  "student_progressions".* FROM "student_progressions" ORDER BY "student_progressions"."id" DESC LIMIT $1  [["LIMIT", 1]]
UPDATE "student_progressions" SET "agenda_index" = $1, "updated_at" = $2 WHERE "student_progressions"."id" = $3  [["agenda_index", 1], ["updated_at", "2020-01-16 16:37:42.552328"], ["id", 15]]
INSERT INTO "student_progressions" ("student_id", "progression_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["student_id", 8], ["progression_id", 7], ["created_at", "2020-01-19 01:13:13.490918"], ["updated_at", "2020-01-19 01:13:13.490918"]]
---
  def create
    if !params[:student_id]
      @progression = Progression.new(progression_params)
      if @progression.save
        #render json: @progression.to_json(only: [:id, :name, :color, :updated_at], include: [:videos]), status: 201
        render json: @progression.to_json(include: [items: { include: [:video]}])
      else
        render json: @progression.errors.full_messages, status: 422
      end
    else
      student = Student.find_by(id: params[:student_id])
      progression = Progression.find_by(id: params[:student][:progressionId])
      student.progressions << progression
      @sp = StudentProgression.last
      @sp.agenda_index = student.progressions.length - 1
      if @sp.save