app/controllers/progressions_controller.rb

INSERT INTO "progressions" ("name", "teacher_id", "created_at", "updated_at", "color") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Week 19 HW"], ["teacher_id", 1], ["created_at", "2020-01-16 16:35:39.428152"], ["updated_at", "2020-01-16 16:35:39.428152"], ["color", "purple"]]
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "progressions".* FROM "progressions" WHERE "progressions"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "student_progressions".* FROM "student_progressions" WHERE "student_progressions"."progression_id" = $1 AND "student_progressions"."student_id" = $2 LIMIT $3  [["progression_id", 6], ["student_id", 6], ["LIMIT", 1]]
SELECT "progressions".* FROM "progressions" INNER JOIN "student_progressions" ON "progressions"."id" = "student_progressions"."progression_id" WHERE "student_progressions"."student_id" = $1  [["student_id", 3]]
---
  def create
    if !params[:student_id]
      @progression = current_user.progressions.build(progression_params)
      if @progression.save
        render json: @progression.to_json(include: [items: { include: [:video, :reflection]}])
      else
        render json: {
          error: @progression.errors.full_messages[0]
          }, status: 422
      end
    else
      student = Student.find_by(id: params[:student_id])
      progression = Progression.find_by(id: params[:student][:progressionId])
      index = params[:student][:index]
      render json: {
        studentProgressions: StudentProgression.new_sp(progression, student, index),
        studentProgression: StudentProgression.find_by(progression_id: progression.id, student_id: student.id)

SELECT  "progressions".* FROM "progressions" WHERE "progressions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @progression = Progression.find_by(id: params[:id])

SELECT  "progressions".* FROM "progressions" WHERE "progressions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "klasses".* FROM "klasses" WHERE "klasses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "student_progressions".* FROM "student_progressions" WHERE "student_progressions"."progression_id" = $1 AND "student_progressions"."student_id" = $2 LIMIT $3  [["progression_id", 7], ["student_id", 9], ["LIMIT", 1]]
UPDATE "student_progressions" SET "agenda_index" = $1, "updated_at" = $2 WHERE "student_progressions"."id" = $3  [["agenda_index", 0], ["updated_at", "2020-01-16 16:37:47.671513"], ["id", 17]]
---
  def update
    if !params[:student_id]
      @progression = Progression.find_by(id: params[:id])
      if params[:klass_id]
        @klass = Klass.find_by(id: params[:klass_id])
        render json: @klass.add_progression_to_all(@progression)
      else
        if @progression.update(progression_params)
          render json: @progression.to_json(include: [items: { include: [:video, :reflection]}])
        else
          render json: {
            error: @progression.errors.full_messages[0]
            }, status: 422
        end
      end
    else
      @student_progression = StudentProgression.find_by(progression_id: params[:id], student_id: params[:student_id])
      if params[:submitted]
        @student_progression.update(submitted: true, submitted_at: Time.zone.now)

SELECT  "progressions".* FROM "progressions" WHERE "progressions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "student_progressions".* FROM "student_progressions" WHERE "student_progressions"."student_id" = $1 AND "student_progressions"."progression_id" = $2 LIMIT $3  [["student_id", 11], ["progression_id", 6], ["LIMIT", 1]]
DELETE FROM "progressions" WHERE "progressions"."id" = $1  [["id", 2]]
DELETE FROM "student_progressions" WHERE "student_progressions"."id" = $1  [["id", 6]]
DELETE FROM "student_progressions" WHERE "student_progressions"."id" = $1  [["id", 23]]
SELECT  "student_progressions".* FROM "student_progressions" WHERE "student_progressions"."student_id" = $1 AND "student_progressions"."progression_id" = $2 LIMIT $3  [["student_id", 11], ["progression_id", 7], ["LIMIT", 1]]
DELETE FROM "student_progressions" WHERE "student_progressions"."id" = $1  [["id", 29]]
---
  def destroy
    if (!params[:student_id])
      @progression = Progression.find_by(id: params[:id])
      @student_progressions = @progression.student_progressions.map{|sp| sp}
      @progression.student_progressions.destroy_all
      @progression.destroy
      render json: {progression: @progression, studentProgressions: @student_progressions}, status: 201
    else
      @student_progression = StudentProgression.find_by(student_id: params[:student_id], progression_id: params[:id])
      @student_progression.destroy