app/controllers/sessions_controller.rb

  def create
    if params[:type] == "teacher"
      @teacher = Teacher.find_by(email: params[:session][:email])
      if @teacher && @teacher.authenticate(params[:session][:password])
        session[:user_id] = @teacher.id
        render json: {
          name: @teacher.name,
          email: @teacher.email,
          id: @teacher.id,
          image_url: @teacher.image_url,
          type: "teacher"
          }, status: 201
      else
        render json: {
          error: "Invalid Credentials", status: 422
        }
      end
    else
      @student = Student.find_by(username: params[:session][:username])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."email" = $1 LIMIT $2  [["email", "adam.sarli@gmail.com"], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."username" = $1 LIMIT $2  [["username", "abutler"], ["LIMIT", 1]]