app/controllers/students_controller.rb

  def index
    @klass = Klass.find_by(id: params[:klass_id])
---
SELECT  "klasses".* FROM "klasses" WHERE "klasses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @klass = Klass.find_by(id: params[:klass_id])
    @student = @klass.students.build(student_params)
    if @student.save
---
SELECT  "klasses".* FROM "klasses" WHERE "klasses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "students" ("firstName", "lastName", "klass_id", "created_at", "updated_at", "username", "password") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    student = Student.find_by(id: params[:id])
    progression = Progression.find_by(id: params[:student][:progressionId])
    student.progressions << progression
    @sp = StudentProgression.last
    @sp.agenda_index = student.progressions.length - 1
    if @sp.save
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "progressions".* FROM "progressions" INNER JOIN "student_progressions" ON "progressions"."id" = "student_progressions"."progression_id" WHERE "student_progressions"."student_id" = $1  [["student_id", 3]]
SELECT "student_progressions".* FROM "student_progressions" WHERE "student_progressions"."student_id" = $1  [["student_id", 3]]
UPDATE "students" SET "firstName" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["firstName", "Angiee"], ["updated_at", "2020-01-18 00:19:07.641111"], ["id", 3]]

  def destroy
    @student = Student.find_by(id: params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]