app/models/klass.rb

  def archive_student_progressions
    progressions_to_be_archived = self.student_progressions.select{|sp| sp.submitted && !sp.archived}
    progressions_to_be_archived.each{|sp| sp.update(archived: true)}

    self.students.each do |student|
      sps = student.student_progressions
      sps = sps.select{ |sp| !sp.archived }
---
SELECT "student_progressions".* FROM "student_progressions" WHERE "student_progressions"."student_id" = $1  [["student_id", 1]]
SELECT "students".* FROM "students" WHERE "students"."klass_id" = $1  [["klass_id", 1]]

  def add_progression_to_all(progression)
    new_sps = self.students.map do |student|
      if student.student_progressions.none?{|sp| sp.progression_id == progression.id}
        sp = student.student_progressions.build
        sp.progression = progression
        sp.agenda_index = student.student_progressions.length
        sp.save
---
INSERT INTO "student_progressions" ("student_id", "progression_id", "agenda_index", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["student_id", 1], ["progression_id", 5], ["agenda_index", 1], ["created_at", "2020-01-16 16:37:37.885353"], ["updated_at", "2020-01-16 16:37:37.885353"]]