app/models/progression.rb

  def items_attributes=(data_array)
    self.items.destroy_all
    data_array.each_with_index do |attributes, index|
      item = Item.new
      if attributes[:videoId]
        new_video = Video.find_or_create_by(attributes)
        item.video = new_video
      else
        new_reflection = Reflection.find_or_create_by(attributes)
        item.reflection = new_reflection
      end
      item.progression_index = index
      self.items << item
---
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 20]]
INSERT INTO "item_videos" ("item_id", "video_id") VALUES ($1, $2) RETURNING "id"  [["item_id", 23], ["video_id", 15]]
INSERT INTO "videos" ("channelTitle", "title", "date", "description", "thumbnailUrl", "videoId", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "items" ("progression_index", "progression_id") VALUES ($1, $2) RETURNING "id"  [["progression_index", 0], ["progression_id", 7]]