app/models/student_progression.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "student_progressions".* FROM "student_progressions" WHERE "student_progressions"."student_id" = $1  [["student_id", 4]]
SELECT  "progressions".* FROM "progressions" WHERE "progressions"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "student_progressions".* FROM "student_progressions" WHERE "student_progressions"."student_id" = $1  [["student_id", 6]]
INSERT INTO "student_progressions" ("student_id", "progression_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["student_id", 11], ["progression_id", 6], ["created_at", "2020-01-19 01:29:09.313581"], ["updated_at", "2020-01-19 01:29:09.313581"]]
UPDATE "student_progressions" SET "agenda_index" = $1, "updated_at" = $2 WHERE "student_progressions"."id" = $3  [["agenda_index", 0], ["updated_at", "2020-01-19 01:29:09.321803"], ["id", 22]]
---
  def self.new_sp(progression, student, index)
    student = Student.find_by(id: student.id)
    progression = Progression.find_by(id: progression.id)
    original_order = student.student_progressions.filter{|sp| !sp.archived}
    original_order = original_order.sort_by{|sp| sp.agenda_index}
    new_sp = self.create(student_id: student.id, progression_id: progression.id)

    number_of_submitted = original_order.select{|sp| sp.submitted && !sp.archived}.length
    inserted_index = index < number_of_submitted ? number_of_submitted : index

    new_order = original_order.insert(inserted_index, new_sp)
    new_order.each_with_index do |sp, ind|
      sp.update(agenda_index: ind)

SELECT "student_progressions".* FROM "student_progressions" WHERE "student_progressions"."student_id" = $1  [["student_id", 11]]
SELECT  "progressions".* FROM "progressions" WHERE "progressions"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "student_progressions" SET "agenda_index" = $1, "updated_at" = $2 WHERE "student_progressions"."id" = $3  [["agenda_index", 0], ["updated_at", "2020-01-19 01:29:26.816229"], ["id", 42]]
---
  def self.rearrange_progressions(student_progression, new_index)
    student = Student.find_by(id: student_progression.student_id)
    original_order = student.student_progressions.filter{|sp| !sp.archived}
    original_order = original_order.sort_by{|sp| sp.agenda_index}
    original_order.delete(student_progression)
    new_order = original_order.insert(new_index, student_progression)
    new_order.each_with_index do |sp, index|
      sp.update(agenda_index: index)